app/controllers/users_controller.rb

INSERT INTO "users" ("email", "token", "password_digest", "created_at", "updated_at", "name", "organization") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def signup
    user = User.create(user_creds)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def signout
    if current_user == User.find(params[:id])

UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", 2017-06-11 19:15:14 UTC], ["password_digest", "$2a$10$A00.m1pRUk8Zd11U51MUBu8pZ4zNCfPibRrrST/kljyhZf4egNZJu"], ["id", 1]]
---
  def changepw
    if !current_user.authenticate(pw_creds[:old]) ||
       (current_user.password = pw_creds[:new]).blank? ||
       !current_user.save